benchmarks/results/pairs/django/grit-write-3.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/bench.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 40s max duration (incl. graceful stop):
              * write: 50 looping VUs for 30s (exec: write, gracefulStop: 10s)


running (01.0s), 50/50 VUs, 2541 complete and 0 interrupted iterations
write   [   3% ] 50 VUs  01.0s/30s

running (02.0s), 50/50 VUs, 6308 complete and 0 interrupted iterations
write   [   7% ] 50 VUs  02.0s/30s

running (03.0s), 50/50 VUs, 8762 complete and 0 interrupted iterations
write   [  10% ] 50 VUs  03.0s/30s

running (04.0s), 50/50 VUs, 11491 complete and 0 interrupted iterations
write   [  13% ] 50 VUs  04.0s/30s

running (05.0s), 50/50 VUs, 14132 complete and 0 interrupted iterations
write   [  17% ] 50 VUs  05.0s/30s

running (06.0s), 50/50 VUs, 18620 complete and 0 interrupted iterations
write   [  20% ] 50 VUs  06.0s/30s

running (07.0s), 50/50 VUs, 22950 complete and 0 interrupted iterations
write   [  23% ] 50 VUs  07.0s/30s

running (08.0s), 50/50 VUs, 28018 complete and 0 interrupted iterations
write   [  27% ] 50 VUs  08.0s/30s

running (09.0s), 50/50 VUs, 33189 complete and 0 interrupted iterations
write   [  30% ] 50 VUs  09.0s/30s

running (10.0s), 50/50 VUs, 38508 complete and 0 interrupted iterations
write   [  33% ] 50 VUs  10.0s/30s

running (11.0s), 50/50 VUs, 43717 complete and 0 interrupted iterations
write   [  37% ] 50 VUs  11.0s/30s

running (12.0s), 50/50 VUs, 49591 complete and 0 interrupted iterations
write   [  40% ] 50 VUs  12.0s/30s

running (13.0s), 50/50 VUs, 54903 complete and 0 interrupted iterations
write   [  43% ] 50 VUs  13.0s/30s

running (14.0s), 50/50 VUs, 58309 complete and 0 interrupted iterations
write   [  47% ] 50 VUs  14.0s/30s

running (15.0s), 50/50 VUs, 61863 complete and 0 interrupted iterations
write   [  50% ] 50 VUs  15.0s/30s

running (16.0s), 50/50 VUs, 64766 complete and 0 interrupted iterations
write   [  53% ] 50 VUs  16.0s/30s

running (17.0s), 50/50 VUs, 67650 complete and 0 interrupted iterations
write   [  57% ] 50 VUs  17.0s/30s

running (18.0s), 50/50 VUs, 70585 complete and 0 interrupted iterations
write   [  60% ] 50 VUs  18.0s/30s

running (19.0s), 50/50 VUs, 74036 complete and 0 interrupted iterations
write   [  63% ] 50 VUs  19.0s/30s

running (20.0s), 50/50 VUs, 77710 complete and 0 interrupted iterations
write   [  67% ] 50 VUs  20.0s/30s

running (21.0s), 50/50 VUs, 82276 complete and 0 interrupted iterations
write   [  70% ] 50 VUs  21.0s/30s

running (22.0s), 50/50 VUs, 90147 complete and 0 interrupted iterations
write   [  73% ] 50 VUs  22.0s/30s

running (23.0s), 50/50 VUs, 96810 complete and 0 interrupted iterations
write   [  77% ] 50 VUs  23.0s/30s

running (24.0s), 50/50 VUs, 104015 complete and 0 interrupted iterations
write   [  80% ] 50 VUs  24.0s/30s

running (25.0s), 50/50 VUs, 109727 complete and 0 interrupted iterations
write   [  83% ] 50 VUs  25.0s/30s

running (26.0s), 50/50 VUs, 117012 complete and 0 interrupted iterations
write   [  87% ] 50 VUs  26.0s/30s

running (27.0s), 50/50 VUs, 123318 complete and 0 interrupted iterations
write   [  90% ] 50 VUs  27.0s/30s

running (28.0s), 50/50 VUs, 131203 complete and 0 interrupted iterations
write   [  93% ] 50 VUs  28.0s/30s

running (29.0s), 50/50 VUs, 138929 complete and 0 interrupted iterations
write   [  97% ] 50 VUs  29.0s/30s

running (30.0s), 50/50 VUs, 146363 complete and 0 interrupted iterations
write   [ 100% ] 50 VUs  30.0s/30s


  █ THRESHOLDS 

    failed_requests
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 293586  9785.37602/s
    checks_succeeded...: 100.00% 293586 out of 293586
    checks_failed......: 0.00%   0 out of 293586

    ✓ status ok
    ✓ has data

    CUSTOM
    failed_requests................: 0.00%  0 out of 146793
    ttfb...........................: avg=8.87ms  min=0s       med=6.79ms max=103.87ms p(90)=17.61ms p(95)=23.32ms

    HTTP
    http_req_duration..............: avg=9.44ms  min=76.77µs  med=7.06ms max=142.5ms  p(90)=18.68ms p(95)=25.19ms
      { expected_response:true }...: avg=9.44ms  min=76.77µs  med=7.06ms max=142.5ms  p(90)=18.68ms p(95)=25.19ms
    http_req_failed................: 0.00%  0 out of 146793
    http_reqs......................: 146793 4892.68801/s

    EXECUTION
    iteration_duration.............: avg=10.16ms min=481.55µs med=7.54ms max=169.32ms p(90)=20.05ms p(95)=27.06ms
    iterations.....................: 146793 4892.68801/s
    vus............................: 50     min=50          max=50
    vus_max........................: 50     min=50          max=50

    NETWORK
    data_received..................: 192 MB 6.4 MB/s
    data_sent......................: 44 MB  1.5 MB/s



running (30.0s), 00/50 VUs, 146793 complete and 0 interrupted iterations
write ✓ [ 100% ] 50 VUs  30s